[View in Colaboratory](https://colab.research.google.com/github/isaacyaf/example/blob/master/titanic_survival_prediction_DNN_lite.ipynb)

# Predict Survival on the Titanic


![ref. kaggle](https://kaggle2.blob.core.windows.net/competitions/kaggle/3136/logos/header.png)

The sinking of the RMS Titanic is one of the most infamous shipwrecks in history.

ref. kaggle-Titanic

In [2]:

# get titanic & test csv files
!curl -L -o titanic_train.csv "https://drive.google.com/uc?export=download&id=1Ao0T6DKiCweVleaGt4rOw625gf7qmzou"
!curl -L -o titanic_test.csv "https://drive.google.com/uc?export=download&id=1EgVFol5j7LI8gweqiQiZ3HWO3S6O7vGT"

  
# pandas, numpy, matplotlib, sns, missingno
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import re as re

#keras
from keras.models import Sequential
from keras.layers.core import Dense, Activation
from keras.optimizers import RMSprop
from IPython.display import clear_output

#set the jupyter notebook
%matplotlib inline

plt.style.use('ggplot')
def plot_train_history(history, train_metrics, val_metrics):
    plt.plot(history.history.get(train_metrics),'-o')
    plt.plot(history.history.get(val_metrics),'-o')
    plt.ylabel(train_metrics)
    plt.xlabel('Epochs')
    plt.legend(['train', 'validation'])
    
def find_data(df,col,data):
  pd_tmp = pd.DataFrame(columns=df.columns.values)
  if data == None:
    pd_tmp = df[df[col].isna()] 
  else:
    for index, data_tmp in enumerate(df[col]):
      if data in str(data_tmp):
        pd_tmp=pd.concat([pd_tmp,df[index:index+1]])
  return pd_tmp

clear_output()

# get titanic data as a DataFrame
titanic_df = pd.read_csv('titanic_train.csv')
test_df    = pd.read_csv('titanic_test.csv')

full_data = [titanic_df, test_df]

# preview the data
titanic_df.head()

,Unnamed: 0,PassengerId,Pclass,Name,Name_length,Title,Sex,Age,Age_Categories,SibSp,Parch,FamilySize,IsAlone,Ticket,Fare,Fare_Categories,Cabin,Has_Cabin,Embarked,Survived
0,1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",51,3,0,38.0,2,1,0,2,0,PC 17599,71.2833,3,C85,1,1,1
1,2,3,3,"Heikkinen, Miss. Laina",22,2,0,26.0,1,0,0,1,1,STON/O2. 3101282,7.9250,1,NaN,0,0,1
2,3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",44,3,0,35.0,2,1,0,2,0,113803,53.1000,3,C123,1,0,1
3,4,5,3,"Allen, Mr. William Henry",24,1,1,35.0,2,0,0,1,1,373450,8.0500,1,NaN,0,0,0
4,5,6,3,"Moran, Mr. James",16,1,1,22.0,1,0,0,1,1,330877,8.4583,1,NaN,0,2,0


|Col. Name|Col. Explanation| Data Explanation |
|---	|---	|--- |
|PassengerId|通行證號碼||   
|Pclass         |社會經濟地位 |1/2/3  = 一等/二等/三等 |
|Name           |乘客姓名||
|Name_length           |乘客姓名長度||
|Title           |頭銜| 1: Mr <br> 2: Miss   <br> 3: Mrs <br> 4: Master  <br> 5: Rare <br><br> Rare = 'Capt', 'Col', 'Countess',	'Don', 'Dr',<br> 'Jonkheer', 'Lady', 'Major', 'Rev', 'Sir'|
|Sex            |性別|0: Female <br> 1: Male|
|Age            |年齡||
|Age            |年齡分類|0: ≤ 16 <br> 1: > 16 &  ≤ 32  <br> 2: > 32 &  ≤ 48  <br> 3: > 48 & ≤ 64  <br> 4: > 64 |
|SibSp          |手足或配偶也在船上的數量||
|Parch          |父母子女也在船上的數量||
|FamilySize          |整個家族在船上的數量|SibSp + Parch + 1|
|IsAlone          |是否跟家族一起搭船|0: 否 <br> 1: 是|
|Ticket         |船票資訊||
|Fare           |票價 (單位: 英鎊)|
|Fare_Categories |票價分類|0: ≤ 7.91 <br> 1: > 7.91 &  ≤ 14.454  <br> 2: > 14.454 &  ≤ 31  <br> 3: > 31  |
|Cabin          |客艙資訊||
|Has_Cabin          |是否有記載客艙資訊|0: 否 <br> 1: 是|
|Embarked       |登船港口 | <br> 0 = Southampton (英格蘭-南安普敦) <br> 1 = Cherbourg(法國-瑟堡)  <br> 2 = Queenstown (紐西蘭-皇后鎮)  |
|Survived       |是否存活 |0 = 否, 1 =是|

# Feature List & Model Building
'Pclass', 'Name_length', 'Title', 'Sex', 'Age', 'Age_Categories', 'SibSp', 'Parch', 'FamilySize', 'IsAlone', 'Fare', 'Fare_Categories', 'Has_Cabin', 'Embarked'

* Pick features that you feel are important

```
# selected_list = ['SibSp', 'Parch', 'FamilySize']
```

In [3]:
#'Pclass', 'Name_length', 'Title', 'Sex', 'Age', 'Age_Categories', 'SibSp', 
#'Parch', 'FamilySize', 'IsAlone', 'Fare', 'Fare_Categories', 'Has_Cabin', 'Embarked'

#================ Select your features ========================
selected_list = ['SibSp', 'Parch', 'FamilySize']

#============================================================


train_tmp = titanic_df[selected_list].values
train_DLy = titanic_df[['Survived']].values
inputdims = len(train_tmp[0])
batch_size = 10
nb_classes = 1
nb_epoch = 30


#================ Build your model ========================
model = Sequential()
model.add(Dense(16, input_dim=inputdims, activation='relu'))
model.add(Dense(32, activation='relu'))
model.add(Dense(16, activation='relu'))
model.add(Dense(1, activation='sigmoid'))
#============================================================


model.summary()
model.compile(loss='binary_crossentropy',
              optimizer='Adam',
              metrics=['accuracy'])


#Learning
history = model.fit(train_tmp, 
                    train_DLy,
                    batch_size=batch_size, 
                    epochs=nb_epoch,
                    verbose=2, 
                    validation_split=0.1)

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_1 (Dense)              (None, 16)                64
_________________________________________________________________
dense_2 (Dense)              (None, 32)                544
_________________________________________________________________
dense_3 (Dense)              (None, 16)                528
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 17
=================================================================
Total params: 1,153
Trainable params: 1,153
Non-trainable params: 0
_________________________________________________________________
Train on 793 samples, validate on 89 samples
Epoch 1/30
 - 2s - loss: 0.6998 - acc: 0.5095 - val_loss: 0.6764 - val_acc: 0.6404
Epoch 2/30
 - 1s - loss: 0.6747 - acc: 0.6116 - val_loss: 0.6567 - val_acc: 0.6404
Epoch 3/30
 - 1s - loss: 0.6647 - acc: 0.6166 - val_loss: 0.6436 - val_acc: 0.6404
Epoch 4/30
 - 1s - loss: 0.6579 - acc: 0.6154 - val_loss: 0.6339 - val_acc: 0.6404
Epoch 5/30
 - 1s - loss: 0.6552 - acc: 0.6192 - val_loss: 0.6251 - val_acc: 0.6404
Epoch 6/30
 - 1s - loss: 0.6527 - acc: 0.6293 - val_loss: 0.6193 - val_acc: 0.6404
Epoch 7/30
 - 1s - loss: 0.6490 - acc: 0.6255 - val_loss: 0.6124 - val_acc: 0.6854
Epoch 8/30
 - 1s - loss: 0.6459 - acc: 0.6356 - val_loss: 0.6062 - val_acc: 0.6854
Epoch 9/30
 - 1s - loss: 0.6452 - acc: 0.6343 - val_loss: 0.5999 - val_acc: 0.6854
Epoch 10/30
 - 1s - loss: 0.6426 - acc: 0.6356 - val_loss: 0.5932 - val_acc: 0.6854
Epoch 11/30
 - 1s - loss: 0.6406 - acc: 0.6368 - val_loss: 0.5924 - val_acc: 0.6854
Epoch 12/30
 - 1s - loss: 0.6407 - acc: 0.6393 - val_loss: 0.5868 - val_acc: 0.6854
Epoch 13/30
 - 1s - loss: 0.6393 - acc: 0.6330 - val_loss: 0.5854 - val_acc: 0.6854
Epoch 14/30
 - 1s - loss: 0.6371 - acc: 0.6343 - val_loss: 0.5806 - val_acc: 0.6854
Epoch 15/30
 - 1s - loss: 0.6370 - acc: 0.6330 - val_loss: 0.5766 - val_acc: 0.6854
Epoch 16/30
 - 1s - loss: 0.6356 - acc: 0.6343 - val_loss: 0.5769 - val_acc: 0.7416
Epoch 17/30
 - 1s - loss: 0.6362 - acc: 0.6318 - val_loss: 0.5764 - val_acc: 0.7753
Epoch 18/30
 - 1s - loss: 0.6350 - acc: 0.6494 - val_loss: 0.5759 - val_acc: 0.7416
Epoch 19/30
 - 1s - loss: 0.6351 - acc: 0.6381 - val_loss: 0.5677 - val_acc: 0.7416
Epoch 20/30
 - 1s - loss: 0.6340 - acc: 0.6368 - val_loss: 0.5704 - val_acc: 0.7753
Epoch 21/30
 - 1s - loss: 0.6334 - acc: 0.6381 - val_loss: 0.5666 - val_acc: 0.7416
Epoch 22/30
 - 1s - loss: 0.6327 - acc: 0.6368 - val_loss: 0.5724 - val_acc: 0.7416
Epoch 23/30
 - 1s - loss: 0.6332 - acc: 0.6520 - val_loss: 0.5673 - val_acc: 0.7753
Epoch 24/30
 - 1s - loss: 0.6331 - acc: 0.6507 - val_loss: 0.5642 - val_acc: 0.7416
Epoch 25/30
 - 1s - loss: 0.6321 - acc: 0.6419 - val_loss: 0.5618 - val_acc: 0.7416
Epoch 26/30
 - 1s - loss: 0.6317 - acc: 0.6393 - val_loss: 0.5668 - val_acc: 0.7416
Epoch 27/30
 - 1s - loss: 0.6315 - acc: 0.6482 - val_loss: 0.5605 - val_acc: 0.7528
Epoch 28/30
 - 1s - loss: 0.6307 - acc: 0.6494 - val_loss: 0.5619 - val_acc: 0.7528
Epoch 29/30
 - 1s - loss: 0.6310 - acc: 0.6507 - val_loss: 0.5641 - val_acc: 0.7753
Epoch 30/30
 - 1s - loss: 0.6296 - acc: 0.6406 - val_loss: 0.5564 - val_acc: 0.7528

In [22]:
nametmp = 'Duane, Mr. Frank'

print(model.predict(find_data(test_df, 'Name', nametmp)[selected_list].values))

#print(display(find_data(test_df, 'Name', nametmp)[selected_list]))
display(find_data(test_df, 'Name', nametmp)[selected_list])

#with pd.option_context('display.max_rows', None, 'display.max_columns', 3):
#    print(find_data(test_df, 'Name', nametmp)[selected_list])

display(test_df[0:5][selected_list])

[[0.3024969]]

  SibSp Parch FamilySize
0     0     0          1

   SibSp  Parch  FamilySize
0      0      0           1
1      0      0           1
2      1      0           2
3      1      2           4
4      0      0           1

In [3]:


nametmp = 'Duane, Mr. Frank'
print(model.predict(find_data(test_df, 'Name', nametmp)[selected_list].values))
nametmp = 'Svensson, Mr. Johan'
print(model.predict(find_data(test_df, 'Name', nametmp)[selected_list].values))
nametmp = 'Braund, Mr. Owen Harris'
print(model.predict(find_data(test_df, 'Name', nametmp)[selected_list].values))
nametmp = 'Herman, Miss. Alice'
print(model.predict(find_data(test_df, 'Name', nametmp)[selected_list].values))
nametmp = 'Turkula, Mrs. (Hedwig)'
print(model.predict(find_data(test_df, 'Name', nametmp)[selected_list].values))


nametmp = 'Guggenheim, Mr. Benjamin'
print(model.predict(find_data(test_df, 'Name', nametmp)[selected_list].values))
nametmp = 'Byles, Rev. Thomas Roussel Davids'
print(model.predict(find_data(test_df, 'Name', nametmp)[selected_list].values))
nametmp = 'Rosalie Ida Blun'
print(model.predict(find_data(test_df, 'Name', nametmp)[selected_list].values))
nametmp = 'Lines, Miss. Mary Conover'
print(model.predict(find_data(test_df, 'Name', nametmp)[selected_list].values))
nametmp = 'Blank, Mr. Henry'
print(model.predict(find_data(test_df, 'Name', nametmp)[selected_list].values))

[[1]]
[]
[[0.30957973]]
[[0.30957973]]
[[0.5078436]]
[[0.50693697]]
[[0.30957973]]
[[0.30957973]]
[[0.30957973]]
[[0.5078436]]
[[0.6093185]]
[[0.30957973]]

In [0]:
JandR_df = pd.DataFrame(
  [ 
  [3, "Jack Dawson", 11, 1, 1, 20.0, 1, 0, 0, 1, 1, "x", 7.0, 0, "x", 0, 0, 0],
  [1, "Rose DeWitt Bukater", 19, 2, 0, 17.0, 1, 0, 0, 1, 1, "x", 20.0, 2, "x", 1, 0, 1]
  ]
, columns=['Pclass', 'Name', 'Name_length', 'Title', 'Sex', 'Age', 
           'Age_Categories', 'SibSp', 'Parch', 'FamilySize', 'IsAlone', 
           'Ticket', 'Fare', 'Fare_Categories', 'Cabin', 'Has_Cabin', 
           'Embarked','Survived'])

#JandR_df

print(model.predict_classes(find_data(JandR_df, 'Name', 'Jack')[selected_list].values))
print(model.predict_classes(find_data(JandR_df, 'Name', 'Rose')[selected_list].values))

,Pclass,Name,Name_length,Title,Sex,Age,Age_Categories,SibSp,Parch,FamilySize,IsAlone,Ticket,Fare,Fare_Categories,Cabin,Has_Cabin,Embarked,Survived
0,3,Jack Dawson,11,1,1,20.0,1,0,0,1,1,x,7.0,0,x,0,0,0
1,1,Rose DeWitt Bukater,19,2,0,17.0,1,0,0,1,1,x,20.0,2,x,1,0,1

In [0]:
#'Pclass', 'Name_length', 'Title', 'Sex', 'Age', 'Age_Categories', 'SibSp', 
#'Parch', 'FamilySize', 'IsAlone', 'Fare', 'Fare_Categories', 'Has_Cabin', 'Embarked'

#titanic_df[["Sex", "Survived"]].groupby(['Sex'], as_index=False).mean().sort_values(by='Survived', ascending=False).plot.bar()
titanic_df[["Sex", "Survived"]].groupby(['Sex']).mean().sort_values(by='Survived', ascending=False).plot.bar()
titanic_df[["Title", "Survived"]].groupby(['Title']).mean().plot.bar()
titanic_df[["Age", "Survived"]].groupby(['Age']).mean().plot.bar()
titanic_df[["Pclass", "Survived"]].groupby(['Pclass']).mean().plot.bar()
titanic_df[["FamilySize", "Survived"]].groupby(['FamilySize']).mean().plot.bar()

titanic_df[["Embarked", "Survived"]].groupby(['Embarked']).mean().plot.bar()
#titanic_df[["Embarked", "Fare_Categories"]].groupby(['Fare_Categories']).plot.bar()

titanic_df.groupby(['Embarked', 'Fare_Categories']).count()[['PassengerId']]

In [0]:
titanic_df[["Age_Categories", "Survived"]].groupby(['Age_Categories']).mean().plot.bar()
titanic_df[["Fare_Categories", "Survived"]].groupby(['Fare_Categories']).mean().plot.bar()

In [0]:
Y_pred = model.predict_classes(test_df[selected_list])
Y_pred = map(lambda x: x[0], Y_pred)
Y_pred = pd.Series(Y_pred)

In [0]:
from sklearn.ensemble import RandomForestClassifier
random_forest = RandomForestClassifier(n_estimators=100)
random_forest.fit(train_tmp, train_DLy)
X_test=test_df[selected_list].values.reshape(-1, len(test_df[selected_list].loc[0]))
Y_pred = random_forest.predict(X_test)
#print(random_forest.score)

In [0]:
print(random_forest.score(train_tmp, train_DLy))
print (Y_pred)
X_test=test_df[selected_list]
print(X_test.loc[0:2].values.reshape(-1, len(X_test.loc[0])))

In [0]:
submission = pd.DataFrame({
        "PassengerId": test_df["PassengerId"],
        "Survived": Y_pred
    })

In [0]:
submission.to_csv('submission.csv', index=False)

from google.colab import files
#uploaded = files.upload() # then browse, select the files. It's then uploaded

files.download('submission.csv')

In [0]:
titanic_df.groupby(['Pclass', 'Has_Cabin']).count()[['PassengerId']]

                  PassengerId
Pclass Has_Cabin
1      0                   40
       1                  176
2      0                  168
       1                   16
3      0                  479
       1                   12

In [0]:
#find_data(titanic_df, 'Pclass', '1')
titanic_df[(titanic_df.Survived == 1)  & (titanic_df.Pclass == 1) ]

,Unnamed: 0,PassengerId,Pclass,Name,Name_length,Title,Sex,Age,Age_Categories,SibSp,Parch,FamilySize,IsAlone,Ticket,Fare,Fare_Categories,Cabin,Has_Cabin,Embarked,Survived
2,2,3,3,"Heikkinen, Miss. Laina",22,2,0,26.00,1,0,0,1,1,STON/O2. 3101282,7.9250,1,NaN,0,0,1
8,8,9,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",49,3,0,27.00,1,0,2,3,0,347742,11.1333,1,NaN,0,0,1
10,10,11,3,"Sandstrom, Miss. Marguerite Rut",31,2,0,4.00,0,1,1,3,0,PP 9549,16.7000,2,G6,1,0,1
19,19,20,3,"Masselmani, Mrs. Fatima",23,3,0,22.00,1,0,0,1,1,2649,7.2250,0,NaN,0,1,1
22,22,23,3,"McGowan, Miss. Anna ""Annie""",27,2,0,15.00,0,0,0,1,1,330923,8.0292,1,NaN,0,2,1
25,25,26,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",57,3,0,38.00,2,1,5,7,0,347077,31.3875,3,NaN,0,0,1
28,28,29,3,"O'Dwyer, Miss. Ellen ""Nellie""",29,2,0,22.00,1,0,0,1,1,330959,7.8792,0,NaN,0,2,1
32,32,33,3,"Glynn, Miss. Mary Agatha",24,2,0,22.00,1,0,0,1,1,335677,7.7500,0,NaN,0,2,1
36,36,37,3,"Mamee, Mr. Hanna",16,1,1,22.00,1,0,0,1,1,2677,7.2292,0,NaN,0,1,1
39,39,40,3,"Nicola-Yarred, Miss. Jamila",27,2,0,14.00,0,1,0,2,0,2651,11.2417,1,NaN,0,1,1
44,44,45,3,"Devaney, Miss. Margaret Delia",29,2,0,19.00,1,0,0,1,1,330958,7.8792,0,NaN,0,2,1
47,47,48,3,"O'Driscoll, Miss. Bridget",25,2,0,22.00,1,0,0,1,1,14311,7.7500,0,NaN,0,2,1
65,65,66,3,"Moubarek, Master. Gerios",24,4,1,22.00,1,1,1,3,0,2661,15.2458,2,NaN,0,1,1
68,68,69,3,"Andersson, Miss. Erna Alexandra",31,2,0,17.00,1,4,2,7,0,3101281,7.9250,1,NaN,0,0,1
74,74,75,3,"Bing, Mr. Lee",13,1,1,32.00,1,0,0,1,1,1601,56.4958,3,NaN,0,0,1
79,79,80,3,"Dowdell, Miss. Elizabeth",24,2,0,30.00,1,0,0,1,1,364516,12.4750,1,NaN,0,0,1
81,81,82,3,"Sheerlinck, Mr. Jan Baptist",27,1,1,29.00,1,0,0,1,1,345779,9.5000,1,NaN,0,0,1
82,82,83,3,"McDermott, Miss. Brigdet Delia",30,2,0,22.00,1,0,0,1,1,330932,7.7875,0,NaN,0,2,1
85,85,86,3,"Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...",55,3,0,33.00,2,3,0,4,0,3101278,15.8500,2,NaN,0,0,1
106,106,107,3,"Salkjelsvik, Miss. Anna Kristine",32,2,0,21.00,1,0,0,1,1,343120,7.6500,0,NaN,0,0,1
107,107,108,3,"Moss, Mr. Albert Johan",22,1,1,22.00,1,0,0,1,1,312991,7.7750,0,NaN,0,0,1
109,109,110,3,"Moran, Miss. Bertha",19,2,0,22.00,1,1,0,2,0,371110,24.1500,2,NaN,0,2,1
125,125,126,3,"Nicola-Yarred, Master. Elias",28,4,1,12.00,0,1,0,2,0,2651,11.2417,1,NaN,0,1,1
127,127,128,3,"Madsen, Mr. Fridtjof Arne",25,1,1,24.00,1,0,0,1,1,C 17369,7.1417,0,NaN,0,0,1
128,128,129,3,"Peter, Miss. Anna",17,2,0,22.00,1,1,1,3,0,2668,22.3583,2,F E69,1,1,1
141,141,142,3,"Nysten, Miss. Anna Sofia",24,2,0,22.00,1,0,0,1,1,347081,7.7500,0,NaN,0,0,1
142,142,143,3,"Hakkarainen, Mrs. Pekka Pietari (Elin Matilda ...",52,3,0,24.00,1,1,0,2,0,STON/O2. 3101279,15.8500,2,NaN,0,0,1
146,146,147,3,"Andersson, Mr. August Edvard (""Wennerstrom"")",44,1,1,27.00,1,0,0,1,1,350043,7.7958,0,NaN,0,0,1
156,156,157,3,"Gilnagh, Miss. Katherine ""Katie""",32,2,0,16.00,0,0,0,1,1,35851,7.7333,0,NaN,0,2,1
165,165,166,3,"Goldsmith, Master. Frank John William ""Frankie""",47,4,1,9.00,0,0,2,3,0,363291,20.5250,2,NaN,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
643,643,644,3,"Foo, Mr. Choong",15,1,1,22.00,1,0,0,1,1,1601,56.4958,3,NaN,0,0,1
644,644,645,3,"Baclini, Miss. Eugenie",22,2,0,0.75,0,2,1,4,0,2666,19.2583,2,NaN,0,1,1
649,649,650,3,"Stanley, Miss. Amy Zillah Elsie",31,2,0,23.00,1,0,0,1,1,CA. 2314,7.5500,0,NaN,0,0,1
653,653,654,3,"O'Leary, Miss. Hanora ""Norah""",29,2,0,22.00,1,0,0,1,1,330919,7.8292,0,NaN,0,2,1
664,664,665,3,"Lindqvist, Mr. Eino William",27,1,1,20.00,1,1,0,2,0,STON/O 2. 3101285,7.9250,1,NaN,0,0,1
677,677,678,3,"Turja, Miss. Anna Sofia",23,2,0,18.00,1,0,0,1,1,4138,9.8417,1,NaN,0,0,1
691,691,692,3,"Karun, Miss. Manca",18,2,0,4.00,0,0,1,2,0,349256,13.4167,1,NaN,0,1,1
692,692,693,3,"Lam, Mr. Ali",12,1,1,22.00,1,0,0,1,1,1601,56.4958,3,NaN,0,0,1
697,697,698,3,"Mullens, Miss. Katherine ""Katie""",32,2,0,22.00,1,0,0,1,1,35852,7.7333,0,NaN,0,2,1
709,709,710,3,"Moubarek, Master. Halim Gonios (""William George"")",49,4,1,22.00,1,1,1,3,0,2661,15.2458,2,NaN,0,1,1
727,727,728,3,"Mannion, Miss. Margareth",24,2,0,22.00,1,0,0,1,1,36866,7.7375,0,NaN,0,2,1
744,744,745,3,"Stranden, Mr. Juho",18,1,1,31.00,1,0,0,1,1,STON/O 2. 3101288,7.9250,1,NaN,0,0,1
751,751,752,3,"Moor, Master. Meier",19,4,1,6.00,0,0,1,2,0,392096,12.4750,1,E121,1,0,1
762,762,763,3,"Barah, Mr. Hanna Assi",21,1,1,20.00,1,0,0,1,1,2663,7.2292,0,NaN,0,1,1
777,777,778,3,"Emanuel, Miss. Virginia Ethel",29,2,0,5.00,0,0,0,1,1,364516,12.4750,1,NaN,0,0,1
780,780,781,3,"Ayoub, Miss. Banoura",20,2,0,13.00,0,0,0,1,1,2687,7.2292,0,NaN,0,1,1
786,786,787,3,"Sjoblom, Miss. Anna Sofia",25,2,0,18.00,1,0,0,1,1,3101265,7.4958,0,NaN,0,0,1
788,788,789,3,"Dean, Master. Bertram Vere",26,4,1,1.00,0,1,2,4,0,C.A. 2315,20.5750,2,NaN,0,0,1
797,797,798,3,"Osman, Mrs. Mara",16,3,0,31.00,1,0,0,1,1,349244,8.6833,1,NaN,0,0,1
803,803,804,3,"Thomas, Master. Assad Alexander",31,4,1,0.42,0,0,1,2,0,2625,8.5167,1,NaN,0,1,1
804,804,805,3,"Hedman, Mr. Oskar Arvid",23,1,1,27.00,1,0,0,1,1,347089,6.9750,0,NaN,0,0,1
821,821,822,3,"Lulic, Mr. Nikola",17,1,1,27.00,1,0,0,1,1,315098,8.6625,1,NaN,0,0,1
823,823,824,3,"Moor, Mrs. (Beila)",18,3,0,27.00,1,0,1,2,0,392096,12.4750,1,E121,1,0,1
828,828,829,3,"McCormack, Mr. Thomas Joseph",28,1,1,22.00,1,0,0,1,1,367228,7.7500,0,NaN,0,2,1
830,830,831,3,"Yasbeck, Mrs. Antoni (Selini Alexander)",39,3,0,15.00,0,1,0,2,0,2659,14.4542,2,NaN,0,1,1
838,838,839,3,"Chip, Mr. Chang",15,1,1,32.00,1,0,0,1,1,1601,56.4958,3,NaN,0,0,1
855,855,856,3,"Aks, Mrs. Sam (Leah Rosen)",26,3,0,18.00,1,0,1,2,0,392091,9.3500,1,NaN,0,0,1
858,858,859,3,"Baclini, Mrs. Solomon (Latifa Qurban)",37,3,0,24.00,1,0,3,4,0,2666,19.2583,2,NaN,0,1,1
869,869,870,3,"Johnson, Master. Harold Theodor",31,4,1,4.00,0,1,1,3,0,347742,11.1333,1,NaN,0,0,1
875,875,876,3,"Najib, Miss. Adele Kiamie ""Jane""",32,2,0,15.00,0,0,0,1,1,2667,7.2250,0,NaN,0,1,1